; domain
(define (domain driverlog)
  (:requirements :typing)
  (:types         location locatable - object
		driver truck package - locatable

  )
  (:predicates
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - package ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)


(:action load-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action unload-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action board-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action disembark-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action drive-truck
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location
    ?truck - truck)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action walk
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))


)

; problem
(define (problem DLOG-4-4-19)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	package1 - package
	package2 - package
	package3 - package
	package4 - package
	package5 - package
	package6 - package
	package7 - package
	package8 - package
	package9 - package
	package10 - package
	package11 - package
	package12 - package
	package13 - package
	package14 - package
	package15 - package
	package16 - package
	package17 - package
	package18 - package
	package19 - package
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	s7 - location
	s8 - location
	s9 - location
	p0-1 - location
	p1-2 - location
	p1-4 - location
	p1-5 - location
	p2-0 - location
	p2-1 - location
	p2-6 - location
	p2-9 - location
	p4-0 - location
	p4-5 - location
	p6-2 - location
	p6-4 - location
	p6-7 - location
	p6-8 - location
	p7-0 - location
	p8-7 - location
	p9-0 - location
	p9-3 - location
	p9-7 - location
	)
	(:init
	(at driver1 s8)
	(at driver2 s3)
	(at driver3 s1)
	(at driver4 s7)
	(at truck1 s0)
	(empty truck1)
	(at truck2 s9)
	(empty truck2)
	(at truck3 s0)
	(empty truck3)
	(at truck4 s2)
	(empty truck4)
	(at package1 s9)
	(at package2 s6)
	(at package3 s9)
	(at package4 s5)
	(at package5 s0)
	(at package6 s2)
	(at package7 s0)
	(at package8 s5)
	(at package9 s8)
	(at package10 s0)
	(at package11 s7)
	(at package12 s9)
	(at package13 s5)
	(at package14 s2)
	(at package15 s6)
	(at package16 s7)
	(at package17 s9)
	(at package18 s9)
	(at package19 s0)
	(path s0 p0-1)
	(path p0-1 s0)
	(path s1 p0-1)
	(path p0-1 s1)
	(path s1 p1-2)
	(path p1-2 s1)
	(path s2 p1-2)
	(path p1-2 s2)
	(path s1 p1-4)
	(path p1-4 s1)
	(path s4 p1-4)
	(path p1-4 s4)
	(path s1 p1-5)
	(path p1-5 s1)
	(path s5 p1-5)
	(path p1-5 s5)
	(path s2 p2-0)
	(path p2-0 s2)
	(path s0 p2-0)
	(path p2-0 s0)
	(path s2 p2-6)
	(path p2-6 s2)
	(path s6 p2-6)
	(path p2-6 s6)
	(path s2 p2-9)
	(path p2-9 s2)
	(path s9 p2-9)
	(path p2-9 s9)
	(path s4 p4-0)
	(path p4-0 s4)
	(path s0 p4-0)
	(path p4-0 s0)
	(path s4 p4-5)
	(path p4-5 s4)
	(path s5 p4-5)
	(path p4-5 s5)
	(path s6 p6-4)
	(path p6-4 s6)
	(path s4 p6-4)
	(path p6-4 s4)
	(path s6 p6-7)
	(path p6-7 s6)
	(path s7 p6-7)
	(path p6-7 s7)
	(path s6 p6-8)
	(path p6-8 s6)
	(path s8 p6-8)
	(path p6-8 s8)
	(path s7 p7-0)
	(path p7-0 s7)
	(path s0 p7-0)
	(path p7-0 s0)
	(path s8 p8-7)
	(path p8-7 s8)
	(path s7 p8-7)
	(path p8-7 s7)
	(path s9 p9-0)
	(path p9-0 s9)
	(path s0 p9-0)
	(path p9-0 s0)
	(path s9 p9-3)
	(path p9-3 s9)
	(path s3 p9-3)
	(path p9-3 s3)
	(path s9 p9-7)
	(path p9-7 s9)
	(path s7 p9-7)
	(path p9-7 s7)
	(link s0 s4)
	(link s4 s0)
	(link s0 s8)
	(link s8 s0)
	(link s1 s5)
	(link s5 s1)
	(link s1 s9)
	(link s9 s1)
	(link s2 s8)
	(link s8 s2)
	(link s3 s1)
	(link s1 s3)
	(link s3 s2)
	(link s2 s3)
	(link s3 s7)
	(link s7 s3)
	(link s3 s8)
	(link s8 s3)
	(link s4 s2)
	(link s2 s4)
	(link s4 s7)
	(link s7 s4)
	(link s5 s2)
	(link s2 s5)
	(link s5 s3)
	(link s3 s5)
	(link s5 s6)
	(link s6 s5)
	(link s5 s8)
	(link s8 s5)
	(link s6 s1)
	(link s1 s6)
	(link s6 s2)
	(link s2 s6)
	(link s6 s4)
	(link s4 s6)
	(link s6 s7)
	(link s7 s6)
	(link s7 s0)
	(link s0 s7)
	(link s7 s8)
	(link s8 s7)
	(link s8 s6)
	(link s6 s8)
	(link s9 s5)
	(link s5 s9)
	(link s9 s6)
	(link s6 s9)
)
	(:goal (and
	(at driver1 s0)
	(at driver2 s7)
	(at driver4 s0)
	(at truck1 s7)
	(at truck4 s2)
	(at package1 s2)
	(at package2 s4)
	(at package3 s2)
	(at package4 s6)
	(at package5 s7)
	(at package6 s5)
	(at package7 s5)
	(at package8 s5)
	(at package9 s5)
	(at package10 s7)
	(at package11 s7)
	(at package12 s3)
	(at package13 s2)
	(at package14 s8)
	(at package15 s8)
	(at package16 s1)
	(at package17 s2)
	(at package18 s8)
	(at package19 s6)
	))


)

; plan
1. (walk driver3 s1 p0-1)
   deleted: (at driver3 s1)
   added: (at driver3 p0-1)
   goals met: 3 of 24
2. (walk driver3 p0-1 s0)
   deleted: (at driver3 p0-1)
   added: (at driver3 s0)
   goals met: 3 of 24
3. (board-truck driver3 s0 truck1)
   deleted: (at driver3 s0) (empty truck1)
   added: (driving driver3 truck1)
   goals met: 3 of 24
4. (drive-truck driver3 s0 s7 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s7)
   goals met: 4 of 24
5. (drive-truck driver3 s7 s6 truck1)
   deleted: (at truck1 s7)
   added: (at truck1 s6)
   goals met: 3 of 24
6. (load-truck s6 package2 truck1)
   deleted: (at package2 s6)
   added: (in package2 truck1)
   goals met: 3 of 24
7. (load-truck s6 package15 truck1)
   deleted: (at package15 s6)
   added: (in package15 truck1)
   goals met: 3 of 24
8. (walk driver1 s8 p8-7)
   deleted: (at driver1 s8)
   added: (at driver1 p8-7)
   goals met: 3 of 24
9. (walk driver1 p8-7 s7)
   deleted: (at driver1 p8-7)
   added: (at driver1 s7)
   goals met: 3 of 24
10. (walk driver1 s7 p7-0)
   deleted: (at driver1 s7)
   added: (at driver1 p7-0)
   goals met: 3 of 24
11. (load-truck s0 package7 truck3)
   deleted: (at package7 s0)
   added: (in package7 truck3)
   goals met: 3 of 24
12. (load-truck s0 package5 truck3)
   deleted: (at package5 s0)
   added: (in package5 truck3)
   goals met: 3 of 24
13. (load-truck s0 package19 truck3)
   deleted: (at package19 s0)
   added: (in package19 truck3)
   goals met: 3 of 24
14. (load-truck s0 package10 truck3)
   deleted: (at package10 s0)
   added: (in package10 truck3)
   goals met: 3 of 24
15. (walk driver1 p7-0 s0)
   deleted: (at driver1 p7-0)
   added: (at driver1 s0)
   goals met: 4 of 24
16. (board-truck driver1 s0 truck3)
   deleted: (at driver1 s0) (empty truck3)
   added: (driving driver1 truck3)
   goals met: 3 of 24
17. (drive-truck driver1 s0 s7 truck3)
   deleted: (at truck3 s0)
   added: (at truck3 s7)
   goals met: 3 of 24
18. (unload-truck s7 package5 truck3)
   deleted: (in package5 truck3)
   added: (at package5 s7)
   goals met: 4 of 24
19. (load-truck s7 package16 truck3)
   deleted: (at package16 s7)
   added: (in package16 truck3)
   goals met: 4 of 24
20. (drive-truck driver1 s7 s6 truck3)
   deleted: (at truck3 s7)
   added: (at truck3 s6)
   goals met: 4 of 24
21. (drive-truck driver3 s6 s2 truck1)
   deleted: (at truck1 s6)
   added: (at truck1 s2)
   goals met: 4 of 24
22. (drive-truck driver1 s6 s5 truck3)
   deleted: (at truck3 s6)
   added: (at truck3 s5)
   goals met: 4 of 24
23. (drive-truck driver1 s5 s9 truck3)
   deleted: (at truck3 s5)
   added: (at truck3 s9)
   goals met: 4 of 24
24. (load-truck s9 package3 truck3)
   deleted: (at package3 s9)
   added: (in package3 truck3)
   goals met: 4 of 24
25. (load-truck s9 package18 truck3)
   deleted: (at package18 s9)
   added: (in package18 truck3)
   goals met: 4 of 24
26. (drive-truck driver1 s9 s5 truck3)
   deleted: (at truck3 s9)
   added: (at truck3 s5)
   goals met: 4 of 24
27. (unload-truck s5 package7 truck3)
   deleted: (in package7 truck3)
   added: (at package7 s5)
   goals met: 5 of 24
28. (load-truck s5 package4 truck3)
   deleted: (at package4 s5)
   added: (in package4 truck3)
   goals met: 5 of 24
29. (drive-truck driver1 s5 s6 truck3)
   deleted: (at truck3 s5)
   added: (at truck3 s6)
   goals met: 5 of 24
30. (unload-truck s6 package4 truck3)
   deleted: (in package4 truck3)
   added: (at package4 s6)
   goals met: 6 of 24
31. (unload-truck s6 package19 truck3)
   deleted: (in package19 truck3)
   added: (at package19 s6)
   goals met: 7 of 24
32. (load-truck s2 package6 truck1)
   deleted: (at package6 s2)
   added: (in package6 truck1)
   goals met: 7 of 24
33. (drive-truck driver3 s2 s8 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s8)
   goals met: 7 of 24
34. (load-truck s8 package9 truck1)
   deleted: (at package9 s8)
   added: (in package9 truck1)
   goals met: 7 of 24
35. (drive-truck driver3 s8 s5 truck1)
   deleted: (at truck1 s8)
   added: (at truck1 s5)
   goals met: 7 of 24
36. (drive-truck driver1 s6 s8 truck3)
   deleted: (at truck3 s6)
   added: (at truck3 s8)
   goals met: 7 of 24
37. (unload-truck s8 package18 truck3)
   deleted: (in package18 truck3)
   added: (at package18 s8)
   goals met: 8 of 24
38. (unload-truck s5 package9 truck1)
   deleted: (in package9 truck1)
   added: (at package9 s5)
   goals met: 9 of 24
39. (unload-truck s5 package6 truck1)
   deleted: (in package6 truck1)
   added: (at package6 s5)
   goals met: 10 of 24
40. (drive-truck driver3 s5 s6 truck1)
   deleted: (at truck1 s5)
   added: (at truck1 s6)
   goals met: 10 of 24
41. (walk driver2 s3 p9-3)
   deleted: (at driver2 s3)
   added: (at driver2 p9-3)
   goals met: 10 of 24
42. (walk driver2 p9-3 s9)
   deleted: (at driver2 p9-3)
   added: (at driver2 s9)
   goals met: 10 of 24
43. (drive-truck driver3 s6 s7 truck1)
   deleted: (at truck1 s6)
   added: (at truck1 s7)
   goals met: 11 of 24
44. (load-truck s9 package17 truck2)
   deleted: (at package17 s9)
   added: (in package17 truck2)
   goals met: 11 of 24
45. (board-truck driver2 s9 truck2)
   deleted: (at driver2 s9) (empty truck2)
   added: (driving driver2 truck2)
   goals met: 11 of 24
46. (load-truck s9 package12 truck2)
   deleted: (at package12 s9)
   added: (in package12 truck2)
   goals met: 11 of 24
47. (drive-truck driver2 s9 s5 truck2)
   deleted: (at truck2 s9)
   added: (at truck2 s5)
   goals met: 11 of 24
48. (load-truck s5 package13 truck2)
   deleted: (at package13 s5)
   added: (in package13 truck2)
   goals met: 11 of 24
49. (drive-truck driver2 s5 s2 truck2)
   deleted: (at truck2 s5)
   added: (at truck2 s2)
   goals met: 11 of 24
50. (unload-truck s2 package17 truck2)
   deleted: (in package17 truck2)
   added: (at package17 s2)
   goals met: 12 of 24
51. (load-truck s2 package14 truck2)
   deleted: (at package14 s2)
   added: (in package14 truck2)
   goals met: 12 of 24
52. (drive-truck driver2 s2 s3 truck2)
   deleted: (at truck2 s2)
   added: (at truck2 s3)
   goals met: 12 of 24
53. (unload-truck s3 package12 truck2)
   deleted: (in package12 truck2)
   added: (at package12 s3)
   goals met: 13 of 24
54. (drive-truck driver2 s3 s8 truck2)
   deleted: (at truck2 s3)
   added: (at truck2 s8)
   goals met: 13 of 24
55. (unload-truck s8 package14 truck2)
   deleted: (in package14 truck2)
   added: (at package14 s8)
   goals met: 14 of 24
56. (drive-truck driver1 s8 s6 truck3)
   deleted: (at truck3 s8)
   added: (at truck3 s6)
   goals met: 14 of 24
57. (walk driver4 s7 p7-0)
   deleted: (at driver4 s7)
   added: (at driver4 p7-0)
   goals met: 14 of 24
58. (walk driver4 p7-0 s0)
   deleted: (at driver4 p7-0)
   added: (at driver4 s0)
   goals met: 15 of 24
59. (drive-truck driver2 s8 s2 truck2)
   deleted: (at truck2 s8)
   added: (at truck2 s2)
   goals met: 15 of 24
60. (unload-truck s2 package13 truck2)
   deleted: (in package13 truck2)
   added: (at package13 s2)
   goals met: 16 of 24
61. (drive-truck driver2 s2 s8 truck2)
   deleted: (at truck2 s2)
   added: (at truck2 s8)
   goals met: 16 of 24
62. (drive-truck driver2 s8 s7 truck2)
   deleted: (at truck2 s8)
   added: (at truck2 s7)
   goals met: 16 of 24
63. (disembark-truck driver2 s7 truck2)
   deleted: (driving driver2 truck2)
   added: (at driver2 s7) (empty truck2)
   goals met: 17 of 24
64. (drive-truck driver3 s7 s4 truck1)
   deleted: (at truck1 s7)
   added: (at truck1 s4)
   goals met: 16 of 24
65. (unload-truck s4 package2 truck1)
   deleted: (in package2 truck1)
   added: (at package2 s4)
   goals met: 17 of 24
66. (drive-truck driver3 s4 s7 truck1)
   deleted: (at truck1 s4)
   added: (at truck1 s7)
   goals met: 18 of 24
67. (drive-truck driver3 s7 s8 truck1)
   deleted: (at truck1 s7)
   added: (at truck1 s8)
   goals met: 17 of 24
68. (unload-truck s8 package15 truck1)
   deleted: (in package15 truck1)
   added: (at package15 s8)
   goals met: 18 of 24
69. (drive-truck driver3 s8 s7 truck1)
   deleted: (at truck1 s8)
   added: (at truck1 s7)
   goals met: 19 of 24
70. (drive-truck driver1 s6 s1 truck3)
   deleted: (at truck3 s6)
   added: (at truck3 s1)
   goals met: 19 of 24
71. (unload-truck s1 package16 truck3)
   deleted: (in package16 truck3)
   added: (at package16 s1)
   goals met: 20 of 24
72. (drive-truck driver1 s1 s6 truck3)
   deleted: (at truck3 s1)
   added: (at truck3 s6)
   goals met: 20 of 24
73. (drive-truck driver1 s6 s7 truck3)
   deleted: (at truck3 s6)
   added: (at truck3 s7)
   goals met: 20 of 24
74. (unload-truck s7 package10 truck3)
   deleted: (in package10 truck3)
   added: (at package10 s7)
   goals met: 21 of 24
75. (drive-truck driver1 s7 s0 truck3)
   deleted: (at truck3 s7)
   added: (at truck3 s0)
   goals met: 21 of 24
76. (drive-truck driver3 s7 s6 truck1)
   deleted: (at truck1 s7)
   added: (at truck1 s6)
   goals met: 20 of 24
77. (drive-truck driver3 s6 s9 truck1)
   deleted: (at truck1 s6)
   added: (at truck1 s9)
   goals met: 20 of 24
78. (load-truck s9 package1 truck1)
   deleted: (at package1 s9)
   added: (in package1 truck1)
   goals met: 20 of 24
79. (drive-truck driver3 s9 s6 truck1)
   deleted: (at truck1 s9)
   added: (at truck1 s6)
   goals met: 20 of 24
80. (drive-truck driver3 s6 s2 truck1)
   deleted: (at truck1 s6)
   added: (at truck1 s2)
   goals met: 20 of 24
81. (unload-truck s2 package1 truck1)
   deleted: (in package1 truck1)
   added: (at package1 s2)
   goals met: 21 of 24
82. (drive-truck driver3 s2 s8 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s8)
   goals met: 21 of 24
83. (drive-truck driver3 s8 s7 truck1)
   deleted: (at truck1 s8)
   added: (at truck1 s7)
   goals met: 22 of 24
84. (drive-truck driver1 s0 s8 truck3)
   deleted: (at truck3 s0)
   added: (at truck3 s8)
   goals met: 22 of 24
85. (drive-truck driver1 s8 s2 truck3)
   deleted: (at truck3 s8)
   added: (at truck3 s2)
   goals met: 22 of 24
86. (unload-truck s2 package3 truck3)
   deleted: (in package3 truck3)
   added: (at package3 s2)
   goals met: 23 of 24
87. (disembark-truck driver1 s2 truck3)
   deleted: (driving driver1 truck3)
   added: (at driver1 s2) (empty truck3)
   goals met: 23 of 24
88. (walk driver1 s2 p2-0)
   deleted: (at driver1 s2)
   added: (at driver1 p2-0)
   goals met: 23 of 24
89. (walk driver1 p2-0 s0)
   deleted: (at driver1 p2-0)
   added: (at driver1 s0)
   goals met: 24 of 24
